emacs.d-gnu/config.org
#+TITLE: init.el
#+PROPERTY: header-args :tangle ~/.emacs.d/init.el

* Table of contents :toc:
- [[#emacs-startup][emacs startup]]
  - [[#shift-theme-variables-to-customel-make-sure-to-create-it-if-it-does-not-exist][shift theme variables to ~custom.el~, make sure to create it if it does not exist]]
  - [[#emacs-startup-performance][emacs startup performance]]
- [[#initialize-package-sources][Initialize package sources]]
  - [[#packageel][Package.el]]
  - [[#enable-native-comp-for-packages][enable native comp for packages]]
  - [[#quelpa][quelpa]]
  - [[#setting-up-paths][Setting up paths]]
- [[#customizing-the-editor-and-appearence][Customizing the Editor and Appearence]]
  - [[#bookmarks-file][bookmarks file]]
  - [[#recents][recents]]
  - [[#rainbow-mode-for-colors][rainbow mode for colors]]
  - [[#smooth-scrolling][smooth scrolling]]
  - [[#dashboard][Dashboard]]
  - [[#page-break-lines][Page break lines]]
  - [[#highlight-current-line][highlight current line]]
  - [[#properly-maximize-windws-emacs][properly maximize windws emacs]]
  - [[#theme][theme]]
  - [[#disable-menubar][Disable Menubar]]
  - [[#disable-toolbar][Disable Toolbar]]
  - [[#disable-scrollbar][disable scrollbar]]
  - [[#all-the-icon-fonts][All the icon fonts]]
  - [[#line-numbers][Line Numbers]]
  - [[#no-blinking-cursor][no blinking cursor]]
  - [[#modeline][Modeline]]
  - [[#fonts][Fonts]]
  - [[#evil-mode][Evil mode]]
  - [[#undo-system][Undo system]]
  - [[#padding][Padding]]
  - [[#brackets][brackets]]
- [[#hook-to-tangle-on-save][Hook to tangle on save]]
- [[#org-mode][Org mode:]]
  - [[#org-mode-indent][org mode indent]]
  - [[#org-blocks-insert-mode][Org blocks insert mode]]
  - [[#snippets][snippets:]]
  - [[#org-tempo-for-all-the-beautiful-snippets][org tempo for all the beautiful snippets:]]
  - [[#org-modern][org modern]]
  - [[#org-toc][org-toc]]
  - [[#fixing-org-blocks][fixing org blocks]]
  - [[#company-org-block][company org block]]
  - [[#org-bable-load-all-languages][org-bable load all languages]]
  - [[#org-roam][org roam]]
- [[#tools][Tools]]
  - [[#vterm][vterm]]
  - [[#bongo][Bongo]]
  - [[#minimap][Minimap]]
  - [[#mentor-torrent-client][Mentor Torrent client]]
  - [[#selectrical-mode][selectrical mode]]
  - [[#telega][telega]]
  - [[#emacs-pdf-tools][emacs pdf tools]]
  - [[#mu4e][mu4e]]
  - [[#treemacs][treemacs]]
  - [[#neotree][neotree]]
  - [[#elcord][elcord]]
  - [[#shackle][Shackle]]
  - [[#pacman][pacman]]
  - [[#popperel-todo][popper.el TODO]]
  - [[#erc-server-settings][ERC server settings]]
  - [[#elfeed-rss-reader][elfeed RSS reader]]
- [[#language-and-completion-support][Language and completion support]]
  - [[#completion-engines][completion engines:]]
  - [[#treesitter][treesitter]]
  - [[#emoji-mode][emoji mode]]
  - [[#parentheses-completion][Parentheses Completion]]
  - [[#projectile][Projectile]]
  - [[#vertico-and-orderless][vertico and orderless]]
  - [[#languages-and-lsp-mode][languages and lsp-mode]]
  - [[#which-key][which key]]
- [[#prevent-saving-to-x-clipboard-manager][prevent "saving to x clipboard manager]]
- [[#prevent-warnings-spam][prevent *warnings* spam]]

* emacs startup
** shift theme variables to ~custom.el~, make sure to create it if it does not exist
#+begin_src emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load-file (expand-file-name "custom.el" user-emacs-directory))
  (setq gc-cons-threshold 100000000)
#+end_src
** emacs startup performance
#+begin_src emacs-lisp
;; The default is 800 kilobytes.  Measured in bytes.
;; (setq gc-cons-threshold (* 50 1000 1000))
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(defun efs/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
	   (format "%.2f seconds"
		   (float-time
		    (time-subtract after-init-time before-init-time)))
	   gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+end_src

* Initialize package sources
*** straight.el
https://github.com/raxod502/straight.el#getting-started
not currently tangling due to issues with default git repos
#+begin_src emacs-lisp :tangle no
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
(straight-use-package 'use-package)
#+end_src

note: Users of Emacs versions >= 27 will want to add:
#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
#+end_src
** Package.el
#+begin_src emacs-lisp
  
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

#+end_src
** enable native comp for packages
#+begin_src emacs-lisp
  (setq comp-deferred-compilation t)
#+end_src
** quelpa
https://github.com/quelpa/quelpa#installation
#+begin_src emacs-lisp
  (use-package quelpa :ensure t)
#+end_src
** Setting up paths
#+begin_src emacs-lisp 
(use-package exec-path-from-shell :ensure t)
(when (daemonp)
  (exec-path-from-shell-initialize))
#+end_src
* Customizing the Editor and Appearence
** bookmarks file
#+begin_src emacs-lisp
(setq bookmark-default-file "~/.emacs.d/bookmarks" )
#+end_src
** recents
#+begin_src emacs-lisp
(recentf-mode 1)
(setq recentf-max-menu-items 25)
(setq recentf-max-saved-items 25)
(global-set-key "\C-x\ \C-r" 'recentf-open-files)
#+end_src
** rainbow mode for colors
#+begin_src emacs-lisp
(use-package rainbow-mode
  :ensure t)
(define-globalized-minor-mode my-global-rainbow-mode rainbow-mode
  (lambda () (rainbow-mode 1)))

(my-global-rainbow-mode 1)
#+end_src
** smooth scrolling
#+begin_src emacs-lisp 
;; (use-package smooth-scroll :ensure t)
 (pixel-scroll-precision-mode 1)
 (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
 (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
 (setq scroll-step 1) 
;;(pixel-scroll-precision-mode 1)
#+end_src
** Dashboard
#+begin_src emacs-lisp 
(use-package dashboard :ensure t
  :init      ;; tweak dashboard config before loading it
  (setq dashboard-set-heading-icons t)
  ;; Content is not centered by default. To center, set
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
  (setq dashboard-startup-banner `logo) ;; use standard emacs logo as banner
  (setq dashboard-center-content t)
  (setq dashboard-set-navigator t)
  (setq dashboard-page-separator  "\n\f\n")
  (setq dashboard-items '((recents . 5)
                          (agenda . 5 )
                          (bookmarks . 5)
                          (projects . 3)
                          ))
  :config
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book"))))

  (dashboard-setup-startup-hook)

;; (dashboard-refresh-buffer)
(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
#+end_src
*** Test 2 for dashboard
#+begin_src emacs-lisp :tangle no
(use-package dashboard :ensure t)
(require 'dashboard)
(dashboard-setup-startup-hook)
;; Or if you use use-package
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src
** Page break lines
#+begin_src emacs-lisp
(use-package page-break-lines :ensure t)
#+end_src
** highlight current line
#+begin_src emacs-lisp
(global-hl-line-mode +1)
#+end_src

** properly maximize windws emacs
#+begin_src emacs-lisp
(setq frame-resize-pixelwise t)
#+end_src
** theme
#+begin_src emacs-lisp
;; (use-package dracula- ensure t)
(use-package doom-themes :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-one t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  ;; (setq doom-themes-treemacs-theme "doom-one") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config)
  )

#+end_src
** Disable Menubar
#+begin_src emacs-lisp
(menu-bar-mode -1)
#+end_src
** Disable Toolbar
#+begin_src emacs-lisp
(tool-bar-mode -1)
#+end_src
** disable scrollbar
#+begin_src emacs-lisp
(scroll-bar-mode -1)
#+end_src
** All the icon fonts
#+begin_src emacs-lisp
(use-package all-the-icons :ensure t)
#+end_src
** Line Numbers
#+begin_src emacs-lisp
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
#+end_src
** no blinking cursor
#+begin_src emacs-lisp
(blink-cursor-mode 0)
#+end_src
** Modeline
*** Doom Modeline
#+begin_src emacs-lisp
(use-package doom-modeline :ensure t)
(doom-modeline-mode 1)
#+end_src
*** Airline
https://github.com/AnthonyDiGirolamo/airline-themes
#+begin_src emacs-lisp :tangle no
;; (use-package airline-themes :ensure t)
;; (load-theme 'airline-base16_dracula t)
#+end_src

** Fonts
#+begin_src emacs-lisp
;; (add-to-list 'default-frame-alist '(font . "FiraCode Nerd Font-12" ))
(add-to-list 'default-frame-alist '(font . "FantasqueSansMono Nerd Font-14:weight=medium" ))
;; (add-to-list 'default-frame-alist '(font . "Comic Mono-12:weight=medium" ))
;; (set-face-attribute 'default t :font "FiraCode Nerd Font-12")
(setq global-prettify-symbols-mode t)
#+end_src
** Evil mode
https://github.com/emacs-evil/evil
Evil is an extensible vi layer for Emacs. It emulates the main features of Vim.
*** Default
#+begin_src emacs-lisp
;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package general :ensure t
  :after evil
  :config
  (general-create-definer efs/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")
  
  (efs/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme")
    "fde" '(lambda () (interactive) (find-file (expand-file-name "~/.emacs.d/Emacs.org")))))

(use-package evil
  :ensure t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :ensure t
  :after evil
  :config
  (evil-collection-init))


#+end_src
*** Evil args
#+begin_src emacs-lisp
(use-package evil-args :ensure t)

;; bind evil-args text objects
(define-key evil-inner-text-objects-map "a" 'evil-inner-arg)
(define-key evil-outer-text-objects-map "a" 'evil-outer-arg)

;; bind evil-forward/backward-args
(define-key evil-normal-state-map "L" 'evil-forward-arg)
(define-key evil-normal-state-map "H" 'evil-backward-arg)
(define-key evil-motion-state-map "L" 'evil-forward-arg)
(define-key evil-motion-state-map "H" 'evil-backward-arg)

;; bind evil-jump-out-args
(define-key evil-normal-state-map "K" 'evil-jump-out-args)
#+end_src
*** Evil intent plus
#+begin_src emacs-lisp
(use-package evil-indent-plus :ensure t)
#+end_src
*** Evil Snipe
#+begin_src emacs-lisp
(use-package evil-snipe :ensure t)
(evil-snipe-mode +1)
(evil-snipe-override-mode +1)
#+end_src
** Undo system
#+begin_src emacs-lisp
(use-package undo-tree
  :ensure t
  :after evil
  :diminish
  :config
  (evil-set-undo-system 'undo-tree)
  (global-undo-tree-mode 1))

(setq undo-tree-history-directory-alist '(("." . "~/.emacs-temp/")))
#+end_src

** Padding
#+begin_src emacs-lisp
(push '(internal-border-width . 10) default-frame-alist)
#+end_src

** brackets
#+begin_src emacs-lisp
(show-paren-mode 1)
(setq show-paren-style 'parenthesis)
#+end_src

*** Backup settings
*** make emacs-temp if it does not exist
#+begin_src emacs-lisp
(unless (file-exists-p "~/.emacs-temp")
  (mkdir "~/.emacs-temp"))
#+end_src
*** Autosave/Backups directory
 https://emacs.stackexchange.com/questions/33/put-all-backups-into-one-backup-folder
 Put backup files neatly away                                                 
#+begin_src emacs-lisp
(let ((backup-dir "~/.emacs-temp/")
      (auto-saves-dir "~/.emacs-temp/"))
  (dolist (dir (list backup-dir auto-saves-dir))
    (when (not (file-directory-p dir))
      (make-directory dir t)))
  (setq backup-directory-alist `(("." . ,backup-dir))
        auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
        auto-save-list-file-prefix (concat auto-saves-dir ".saves-")
        tramp-backup-directory-alist `((".*" . ,backup-dir))
        tramp-auto-save-directory auto-saves-dir
        ))

(setq backup-by-copying t    ; Don't delink hardlinks                           
      delete-old-versions t  ; Clean up the backups                             
      version-control t      ; Use version numbers on backups,                  
      kept-new-versions 5    ; keep some new versions                           
      kept-old-versions 2)   ; and some old ones, too                           

#+end_src

* Hook to tangle on save
#+begin_src emacs-lisp
(defun tangle-all-org-on-save-h ()
  "Tangle org files on save."
  (if (string= (file-name-extension (buffer-file-name)) "org")
      (org-babel-tangle)))
(add-hook 'after-save-hook #'tangle-all-org-on-save-h)
#+end_src
* Org mode:
#+begin_src emacs-lisp
(use-package org :ensure t)
;; (straight-use-package
;; '(org :type git :host github :repo ""
;;            :fork (:host github
;;                   :repo "your-name/el-patch"))) 
#+end_src
** org mode indent
#+begin_src emacs-lisp
  (setq org-startup-indented t)
#+end_src
** Org blocks insert mode
Switch to org edit mode when pressing `i` insert key
#+begin_src emacs-lisp :tangle no
(add-hook 'org-mode-hook
  (lambda ()
    (add-hook 'evil-insert-state-entry-hook
      (lambda ()
        (when (org-in-src-block-p)
          (org-edit-special)
          (evil-insert-state)))
      0 t)))
#+end_src
** snippets:
*** yas-snippet

#+begin_src emacs-lisp
(use-package yasnippet
  :ensure t
  :config
  (setq yas-snippet-dirs '("~/dotfiles/emacs.d-gnu/snippets"))
  )
(require 'yasnippet)
(yas-global-mode 1)
#+end_src

** org tempo for all the beautiful snippets:

#+begin_src emacs-lisp
  ;; (use-package 'org-tempo :ensure t)
  (require 'org-tempo)
#+end_src
** org modern
https://github.com/minad/org-modern
#+begin_src emacs-lisp
(use-package org-modern :ensure t)
(add-hook 'org-mode-hook #'org-modern-mode)
(add-hook 'org-agenda-finalize-hook #'org-modern-agenda)
#+end_src
** org-toc
#+begin_src emacs-lisp
(use-package toc-org :ensure t)
(add-hook 'org-mode-hook #'toc-org-enable)
#+end_src

** fixing org blocks
#+begin_src emacs-lisp
(setq org-edit-src-content-indentation 0) 
#+end_src
