emacs.d-gnu/config.org
** company org block
#+begin_src emacs-lisp :tangle no
(use-package company-org-block
  :ensure t
  :custom
  (company-org-block-edit-style 'auto) ;; 'auto, 'prompt, or 'inline
  :hook ((org-mode . (lambda ()
                       (setq-local company-backends '(company-org-block))
                       (company-mode +1)))))
#+end_src
** org-bable load all languages
https://orgmode.org/worg/org-contrib/babel/languages/index.html
#+begin_src emacs-lisp
(require 'ob-comint)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((C . t)
   (emacs-lisp . t)
   (python . t)
   (shell . t)
   ;; (nix . t)
   ))
(setq org-babel-python-command "python3")
#+end_src
** org roam
#+begin_src emacs-lisp
  (use-package org-roam :ensure t)
#+end_src

* Tools
** vterm
#+begin_src emacs-lisp
  (use-package vterm
    ;;:ensure t
    :ensure t 
    :config
    ;;(setq vterm-shell "/bin/zsh")
    ;; (set-popup-rule! "^\\*vterm" :size 0.25 :vslot -4 :select t :quit nil :ttl 0)
    (setq vterm-timer-delay 0)
    )
#+end_src
** Bongo
https://github.com/dbrock/bongo
#+begin_src emacs-lisp 
(use-package bongo :ensure t)
#+end_src
** Minimap
#+begin_src emacs-lisp
(use-package minimap
  :ensure t)
#+end_src
** Mentor Torrent client
https://github.com/skangas/mentor
#+begin_src emacs-lisp
  (use-package mentor :ensure t)
#+end_src
** selectrical mode
#+begin_src emacs-lisp
(use-package selectric-mode :ensure t)
#+end_src
** telega
#+begin_src emacs-lisp
(use-package visual-fill-column :ensure t)
(use-package telega :ensure t
  :commands (telega))

#+end_src
** emacs pdf tools
#+begin_src emacs-lisp
(use-package pdf-tools :ensure t)
#+end_src
** mu4e
https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-Mail-01.org
#+begin_src emacs-lisp :tangle no
(use-package mu4e
  :ensure nil
  ;; :defer 20 ; Wait until 20 seconds after startup
  :config

  ;; This is set to 't' to avoid mail syncing issues when using mbsync
  (setq mu4e-change-filenames-when-moving t)

  ;; Refresh mail using isync every 10 minutes
  (setq mu4e-update-interval (* 10 60))
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-maildir "~/Mail")

  (setq mu4e-drafts-folder "/[Gmail]/Drafts")
  (setq mu4e-sent-folder   "/[Gmail]/Sent Mail")
  (setq mu4e-refile-folder "/[Gmail]/All Mail")
  (setq mu4e-trash-folder  "/[Gmail]/Trash")

  (setq mu4e-maildir-shortcuts
        '((:maildir "/Inbox"    :key ?i)
          (:maildir "/[Gmail]/Sent Mail" :key ?s)
          (:maildir "/[Gmail]/Trash"     :key ?t)
          (:maildir "/[Gmail]/Drafts"    :key ?d)
          (:maildir "/[Gmail]/All Mail"  :key ?a))))


#+end_src
** treemacs
#+begin_src emacs-lisp
(use-package treemacs
  :ensure t
  :defer t
  :init
  (with-eval-after-load 'winum
    (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  :config
  (progn
    (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
          treemacs-deferred-git-apply-delay        0.5
          treemacs-directory-name-transformer      #'identity
          treemacs-display-in-side-window          t
          treemacs-eldoc-display                   t
          treemacs-file-event-delay                5000
          treemacs-file-extension-regex            treemacs-last-period-regex-value
          treemacs-file-follow-delay               0.2
          treemacs-file-name-transformer           #'identity
          treemacs-follow-after-init               t
          treemacs-expand-after-init               t
          treemacs-git-command-pipe                ""
          treemacs-goto-tag-strategy               'refetch-index
          treemacs-indentation                     2
          treemacs-indentation-string              " "
          treemacs-is-never-other-window           nil
          treemacs-max-git-entries                 5000
          treemacs-missing-project-action          'ask
          treemacs-move-forward-on-expand          nil
          treemacs-no-png-images                   nil
          treemacs-no-delete-other-windows         t
          treemacs-project-follow-cleanup          nil
          treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
          treemacs-position                        'left
          treemacs-read-string-input               'from-child-frame
          treemacs-recenter-distance               0.1
          treemacs-recenter-after-file-follow      nil
          treemacs-recenter-after-tag-follow       nil
          treemacs-recenter-after-project-jump     'always
          treemacs-recenter-after-project-expand   'on-distance
          treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
          treemacs-show-cursor                     nil
          treemacs-show-hidden-files               t
          treemacs-silent-filewatch                nil
          treemacs-silent-refresh                  nil
          treemacs-sorting                         'alphabetic-asc
          treemacs-select-when-already-in-treemacs 'move-back
          treemacs-space-between-root-nodes        t
          treemacs-tag-follow-cleanup              t
          treemacs-tag-follow-delay                1.5
          treemacs-text-scale                      nil
          treemacs-user-mode-line-format           nil
          treemacs-user-header-line-format         nil
          treemacs-wide-toggle-width               70
          treemacs-width                           35
          treemacs-width-increment                 1
          treemacs-width-is-initially-locked       t
          treemacs-workspace-switch-cleanup        nil)

    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode 'always)

    (pcase (cons (not (null (executable-find "git")))
                 (not (null treemacs-python-executable)))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple)))

    (treemacs-hide-gitignored-files-mode nil))
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t B"   . treemacs-bookmark)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))

(use-package treemacs-evil
  :after (treemacs evil)
  :ensure t)

(use-package treemacs-projectile
  :after (treemacs projectile)
  :ensure t)

(use-package treemacs-icons-dired
  :hook (dired-mode . treemacs-icons-dired-enable-once)
  :ensure t)

(use-package treemacs-magit
  :after (treemacs magit)
  :ensure t)

(use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
  :after (treemacs persp-mode) ;;or perspective vs. persp-mode
  :ensure t
  :config (treemacs-set-scope-type 'Perspectives))
#+end_src
** neotree
#+begin_src emacs-lisp
(use-package neotree :ensure t)
#+end_src
** elcord
#+begin_src emacs-lisp
(use-package elcord :ensure t)
#+end_src
** Shackle
#+begin_src emacs-lisp
(use-package shackle
  :ensure t
  ;; :if (not (bound-and-true-p disable-pkg-shackle))
  :config
  (progn
    (setq shackle-lighter "")
    (setq shackle-select-reused-windows nil) ; default nil
    (setq shackle-default-alignment 'below) ; default below
    (setq shackle-default-size 0.4) ; default 0.5

    (setq shackle-rules
          ;; CONDITION(:regexp)            :select     :inhibit-window-quit   :size+:align|:other     :same|:popup
          '((compilation-mode              :select nil                                               )
            ("*undo-tree*"                 :select t                          :size 0.25 :align right)
            ("\\*vterm.*\\*"  :regexp t    :select t                          :size 0.4  :align below)
            ;; ("*eshell*"                    :select t                          :other t               )
            ;;         ("*Shell Command Output*"      :select nil                                               )
            ;;         ("\\*Async Shell.*\\*" :regexp t :ignore t                                                 )
            ;;         (occur-mode                    :select nil                                   :align t    )
            ;;         ("*Help*"                      :select t   :inhibit-window-quit t :other t               )
            ;;         ("*Completions*"                                                  :size 0.3  :align t    )
            ;;         ("*Messages*"                  :select nil :inhibit-window-quit t :other t               )
            ;;         ("\\*[Wo]*Man.*\\*"    :regexp t :select t   :inhibit-window-quit t :other t               )
            ;;         ("\\*poporg.*\\*"      :regexp t :select t                          :other t               )
            ;;         ("\\`\\*helm.*?\\*\\'"   :regexp t                                    :size 0.3  :align t    )
            ;;         ("*calendar*"                  :select t                          :size 0.5  :align below)
            ;;         ("*info*"                      :select t   :inhibit-window-quit t                         :same t)
            ;;         (magit-status-mode             :select t   :inhibit-window-quit t                         :same t)
            ;;         (magit-log-mode                :select t   :inhibit-window-quit t                         :same t)
            ))

    (shackle-mode 1)))


(provide 'setup-shackle)

#+end_src
** pacman
#+begin_src emacs-lisp
(use-package pacmacs :ensure t)
#+end_src
** popper.el TODO
https://github.com/karthink/popper

** ERC server settings
#+begin_src emacs-lisp
(require 'erc)
(setq erc-default-server "irc.libera.chat")
(add-hook 'window-configuration-change-hook
          '(lambda ()
             (setq erc-fill-column (- (window-width) 2))))
#+end_src

** elfeed RSS reader
#+begin_src emacs-lisp
(use-package elfeed :ensure t)
(setq elfeed-feeds
      '(
        ("https://archlinux.org/feeds/news/" Arch Linux)
        ("https://weekly.nixos.org/feeds/all.rss.xml" NixOS)
        ("https://www.phoronix.com/rss.php" Phoronix)
        ("https://suckless.org/atom.xml" suckless)
        ("https://micronews.debian.org/feeds/feed.rss" Debian)
        )
      )
#+end_src

* Language and completion support
** completion engines:
*** company mode
#+begin_src emacs-lisp
(use-package company :ensure t)
(add-hook 'after-init-hook 'global-company-mode)
(setq company-minimum-prefix-length 1
      company-idle-delay 0.2) ;; default is 0.2
#+end_src
** treesitter
#+begin_src emacs-lisp
(use-package tree-sitter :ensure t)
(use-package tree-sitter-langs :ensure t)
(global-tree-sitter-mode)
(add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
#+end_src

** emoji mode
#+begin_src emacs-lisp
(use-package emojify
  :ensure t
  :hook (after-init . global-emojify-mode))
#+end_src
** Parentheses Completion
#+begin_src emacs-lisp
(use-package smartparens :ensure t)
(require 'smartparens)
;; (add-hook 'smartparens-mode)
(smartparens-global-mode t)
#+end_src
** Projectile
#+begin_src emacs-lisp
(use-package projectile :ensure t)
(require 'smartparens-config)
#+end_src

** vertico and orderless
#+begin_src emacs-lisp
;; Enable vertico
(use-package vertico :ensure t
  :init
  (vertico-mode)
  )

(use-package orderless :ensure t
  :init
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist :ensure t
  :init
  (savehist-mode))

;; A few more useful configurations...
(use-package emacs :ensure t
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; Alternatively try `consult-completing-read-multiple'.
  (defun crm-indicator (args)
    (cons (concat "[CRM] " (car args)) (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setq enable-recursive-minibuffers t))
#+end_src

